app/views/contacts/index.html.erb

                    <td><%= contact.created_at.strftime("%Y-%m-%d %H:%M") %></td>
                    <td><%= contact.user.last_name %><%= contact.user.first_name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]