app/views/contacts/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        			<td>#投稿日時</td>
        			<td><%= @contact.user.last_name %><%= @contact.user.first_name %></td>