app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
  def index
  	@artists = Artist.page(params[:page])

INSERT INTO "artists" ("artist_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["artist_name", ""], ["created_at", "2019-05-20 03:29:49.043578"], ["updated_at", "2019-05-20 03:29:49.043578"]]
---
  def create
  	artist = Artist.new(artist_params)
  	if artist.save

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "artists" SET "artist_name" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["artist_name", "うんこちゃん"], ["updated_at", "2019-05-20 03:30:17.829153"], ["id", 1]]
---
  def update
    artist = Artist.find(params[:id])
    if artist.update(artist_params)

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 2]]
---
  def destroy
    artist = Artist.find(params[:id])
    artist.destroy