app/controllers/contacts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def new
		@user = User.find(params[:user_id])

INSERT INTO "contacts" ("user_id", "contact_content", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["contact_content", "AKBが欲しいです。"], ["created_at", "2019-05-20 08:49:40.170171"], ["updated_at", "2019-05-20 08:49:40.170171"], ["title", "商品追加"]]
---
	def create
		contact = Contact.new(contact_params)
		contact.user_id = current_user.id
		if contact.save

SELECT  "contacts".* FROM "contacts" ORDER BY "contacts"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
	def index
		@contact = Contact.new #あとで削除
		@users = User.page(params[:page]).reverse_order
		@contacts = Contact.page(params[:page]).reverse_order

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@user = User.find(params[:user_id])
		@contact = Contact.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "contacts" SET "responce" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["responce", "ごめんなさい。趣味じゃないんです。"], ["updated_at", "2019-05-20 08:50:30.754777"], ["id", 1]]
---
	def update
		user = User.find(params[:user_id])
		contact = Contact.find(params[:id])
		if contact.update(contact_params)