app/controllers/genres_controller.rb

SELECT "genres".* FROM "genres"
---
  def index
  	@genres = Genre.page(params[:page])

INSERT INTO "genres" ("genre_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["genre_name", "J-POP"], ["created_at", "2019-05-20 03:30:35.580094"], ["updated_at", "2019-05-20 03:30:35.580094"]]
---
  def create
  	genre = Genre.new(genre_params)
  	if genre.save