app/controllers/labels_controller.rb

  def index
  	@labels = Label.all
---
SELECT "labels".* FROM "labels"

  def create
  	label = Label.new(label_params)
  	label.save
---
INSERT INTO "labels" ("label_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["label_name", "UUUM"], ["created_at", "2019-05-20 03:30:47.599757"], ["updated_at", "2019-05-20 03:30:47.599757"]]