app/controllers/products_controller.rb

SELECT  "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 28], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
---
  def index
    @products = Product.page(params[:page])

SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
  def search
    @products = Product.page(params[:page])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]
---
  def show
    @product = Product.find(params[:id])
    @reviews = Review.where(product_id: params[:id])

SELECT "products".* FROM "products"
---
  def admin
    @products = Product.all

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recorded_musics".* FROM "recorded_musics" WHERE "recorded_musics"."product_id" = ?  [["product_id", 1]]
---
  def edit
    @product = Product.find(params[:id])
    @recorded_musics = RecordedMusic.where(product_id: params[:id])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "label_id" = ?, "jacket_image_id" = ?, "stock" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["label_id", 1], ["jacket_image_id", nil], ["stock", "0"], ["updated_at", "2019-05-20 07:53:32.225553"], ["id", 1]]
---
  def update
    product = Product.find(params[:id])
    product.update(product_params)

INSERT INTO "products" ("artist_id", "genre_id", "label_id", "product_category", "product_name", "jacket_image_id", "price", "stock", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    product = Product.new(product_params)
    product.save