app/controllers/reviews_controller.rb

	def new
	  @product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
	  product = Product.find(params[:product_id])
	  review = Review.new(review_params)
	  review.product_id = product.id
	  if review.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("product_id", "review_content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["review_content", "kowai"], ["created_at", "2019-05-20 08:02:53.208603"], ["updated_at", "2019-05-20 08:02:53.208603"]]

	def update
	  product = Product.find(params[:product_id])
	  review = Review.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def destroy
	  product = Product.find(params[:product_id])
	  review = Review.find(params[:id])
	  review.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]