app/controllers/user_products_controller.rb

	def index
		@user_product = UserProduct.where(user_id: current_user.id)
		@sum = 0
		@user_product.each do |user_product|
---
SELECT "user_products".* FROM "user_products" WHERE "user_products"."user_id" = ?  [["user_id", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

	def create
		@user_product = UserProduct.new(user_product_params)
	    if @user_product.user_product_number <= @user_product.product.stock
	       @user_product.save
---
INSERT INTO "user_products" ("product_id", "user_id", "user_product_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 1], ["user_id", 3], ["user_product_number", 1], ["created_at", "2019-05-20 08:31:48.358717"], ["updated_at", "2019-05-20 08:31:48.358717"]]

	def update
		user_product = UserProduct.find(params[:id])
		user_product.assign_attributes(user_product_params)
		if user_product.user_product_number <= user_product.product.stock
		  user_product.update(user_product_params)
---
SELECT  "user_products".* FROM "user_products" WHERE "user_products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "user_products" SET "user_product_number" = ?, "updated_at" = ? WHERE "user_products"."id" = ?  [["user_product_number", 2], ["updated_at", "2019-05-20 09:23:53.866388"], ["id", 1]]

	def destroy
		user_product = UserProduct.find(params[:id])
		user_product.destroy
---
SELECT  "user_products".* FROM "user_products" WHERE "user_products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "user_products" WHERE "user_products"."id" = ?  [["id", 3]]