app/views/products/new.html.erb

SELECT "artists".* FROM "artists"
---
    <%= f.label :artist_id, "アーティスト" %>
    <%= f.collection_select :artist_id, Artist.all, :id, :artist_name %>

SELECT "genres".* FROM "genres"
---
    <%= f.label :genre_id, "ジャンル" %>
    <%= f.collection_select :genre_id, Genre.all, :id, :genre_name %>

SELECT "labels".* FROM "labels"
---
    <%= f.label :label_id, "レーベル" %>
    <%= f.collection_select :label_id, Label.all, :id, :label_name %>